HARD_CONSONANTS = {
    "б","в","г","д","з","к","л","м","н","п","р","с","т","ф","х","ц","ш","ж"
}

SOFTENING_VOWELS = {"я", "ю", "ё", "е"}
NON_SOFTENING_VOWELS = {"а", "у", "о", "э"}

VOWEL_PAIRS = {
    "я": "а",
    "ю": "у",
    "ё": "о",
    "е": "э"
}

IOTATED = {"я", "ю", "ё", "е", "и"}

VOICED = {"б", "в", "г", "д", "ж", "з"}

VOICELESS = {"п", "ф", "к", "т", "ш", "с"}

SIBILANTS = {"с", "з", "ц"}
HUSHING = {"ш", "ж", "ч", "щ"}

AFFRICATES = {"ц", "ч"}
AFFRICATE_COMPONENTS = {
    "ц": {"т", "с"},
    "ч": {"т", "ш"}
}

LABIAL_VOWELS = {
    "о": "у",
    "у": "о",
    "ё": "ю",
    "ю": "ё"
}

GRAPHIC_SIMILAR_PAIRS = {
    ("т", "н"), ("у", "и"), ("б", "д"), ("п", "т"),
    ("л", "м"), ("ш", "щ"), ("х", "ж"), ("в", "д"),
    ("г", "р"), ("е", "э"), ("с", "э"), ("з", "э"),
    # часто встречаются у школьников
    ("ё", "е"),                    # потеря точек
    ("ы", "и"), ("и", "й"),
    ("н", "и"), ("п", "г"),
    ("ц", "щ"),
}